module.exports = {
  config: {
    name: "بوت",
    version: "2.0.0",
    author: "كـيـوي ےۦٰ۪۫٭",
    cooldown: 5,
    role: 0,
    hide:"true",
    shortDescription: "الرد التلقائي مع ردود الفعل والردود",
    longDescription: "الرد التلقائي مع ردود الفعل والردود بناءً على كلمات أو مشغلات محددة.",
    category: "النظام",
    guide: "©بوت",
  },
  onStart: async ({ api, event }) => {},
  onChat: async ({ api, event }) => {
    const { body, messageID, threadID } = event;

    const emojis = {
      "👋": ["سلام", "مرحبا", "هلا", "أهلا", "كيفك", "نورت","الحمد لله","السلام عليكم"],
      "⚡": ["وعليكم السلام", "ماذا عنك", "شباب", "رفاق", "كيف حالك","بخير","وانت","دوم","يب"],
      "🌑": ["حزين", "أسف", "خطأ", "لا استطيع", "تعبت"],
      "💀": ["اللعنة", "تبا", "النية", "نية", "كلب ", "أصنام","أكرهك"],
      "🔥": ["مضحك", "هههه", "نكتة", "قطة","مت","ممتع"],
      "💎": ["كفو", "مبدع", "شكرا", "أحبك", "جميل", "واو"],
      "🚀": ["وداعا","إلى اللقاء","تصبح بخير","بنوي","تهلا","ممبعد","مع السلامة"],
      "💥": ["🔥", "نار", "ممتع", "متحمس"],
      "💣": ["خرا","شيت","shit"],
      "🤮": ["مزعج", "مريع", "يثير الإشمئزاز", "horrible"],
      "👑": ["حب", "اخي", "جميل", "رائع", "مدهش", "أحبك"],
      "🤣": ["😂", "🤣", "😭", "🙂", "Drôle", "Amusant", "Hilarant", "Loufoque", "Bouffonnerie", "Cocasse", "Burlesque", "Rigolo", "Absurde", "Irrévérencieux", "Ironique", "Ironie", "Parodie", "Esprit", "Facétieux"],
      "😎": ["رائع"," 😎","كول"],
      "✨": ["خارق", "مدهش"],
      "🤖": ["بوت"],
      "🗿": ["أحا", "احا", "توسوست"],
      "✅": ["حسنا", "تمام", "طيب"],
      "🏆": ["تهانينا", "مبروك", "يااي"],
      "📑": ["أوامر"],
      "🔄": ["ريلوود"],
      "🖕": ["تبا","فاك","🖕"],
      "📢": ["الكل","نداء","إشعار"],
      "👺": ["مممم", "خباشة","نيرد","نارد"],
      "💍": ["زواج"],
      "💵": ["رصيدي"],
      "🦁": ["كيوت"],
      "👁️": ["نعم","لا","رؤية","مارو","مارو"],
      "🚫": ["تقييد","حظر"],
      "🎮": ["الألعاب","لعبة","فري فاير","بابجي"],
      "💚": ["وليدي", "ولدي", "مارو"],
      "❓": ["هاا","ماذا","وش"],
      "🎁": ["هدية"],
      "⚠️": ["تحذير"],
      "🌟": ["أنا بخير", "انا بخير", "انا بخير شكرا", "أنا بخير شكرا", "أنا بخير شكرا لك", "انا بخير شكرا لك", "أنا بخير شكرا لكي", "انا بخير شكرا لكي", "انا بخير ايضا شكرا", "أنا بخير ايضا شكرا", "انا بخير أيضا شكرا", "أنا بخير أيضا", "انا بخير ايضا", "أنا بخير ايضا", "انا بخير أيضا"],
      "💢": ["غضب"],
      "🤝": ["ليندا", "نصرو", "جواد", "مايا", "جيهان"],
      "🥋": ["سأقتلك"]
    };

    const replies = {"🌷🌷🌷":"~~نعم ?? 🙃🌷"};

    for (const [emoji, words] of Object.entries(emojis)) {
      for (const word of words) {
        if (body.toLowerCase().includes(word)) {
          api.setMessageReaction(emoji, messageID, () => {}, true);
        }
      }
    }

    for (const [trigger, reply] of Object.entries(replies)) {
      if (body.toLowerCase().includes(trigger)) {
        api.sendMessage(reply, threadID, messageID);
      }
    }
  },
};